{"metadata":{"title":"Data","interviews":"Data Analyst,Data Engineer","sortorder":2},"content":"<h1 id=\"data-analyst\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#data-analyst\"><span class=\"icon icon-link\"></span></a>Data Analyst</h1>\n<h2 id=\"prerequisites\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#prerequisites\"><span class=\"icon icon-link\"></span></a>Prerequisites</h2>\n<p>In order to complete this test, you will need:</p>\n<ol>\n<li>Your laptop with <a href=\"https://powerbi.microsoft.com/en-us/downloads/\">Power BI Desktop</a> installed.</li>\n<li>A public GitHub repo, or a Google/OneDrive where you can share your workings (E.g. Power BI files).</li>\n</ol>\n<h2 id=\"scenario\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#scenario\"><span class=\"icon icon-link\"></span></a>Scenario</h2>\n<p>As the Data Analyst for a small fuel company, you have been given two (2) data sources.</p>\n<ol>\n<li><a href=\"http://www.fuelwatch.wa.gov.au/fuelwatch/fuelWatchRSS\">The FuelWatch RSS feed</a></li>\n<li><a href=\"/code/discount.xlsx\">Discounts Excel file</a></li>\n</ol>\n<h2 id=\"instructions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#instructions\"><span class=\"icon icon-link\"></span></a>Instructions</h2>\n<p>You have been ask to create a Power BI report that combines both sources to answer questions the business may have around its competitors.</p>\n<h3 id=\"modelling\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#modelling\"><span class=\"icon icon-link\"></span></a>Modelling</h3>\n<ol>\n<li>In Power BI, connect to the two (2) data sources.</li>\n<li>Create three (3) new dimension tables - <strong>Brand</strong>, <strong>Site</strong> and <strong>SiteFeatures</strong>. They should have the respective attributes below.\n<ul>\n<li>BrandID , BrandName</li>\n<li>SiteID , TradingName, Location, Address, Phone, Latitude, Longitude. Please also add a computed, persisted column named <strong><em>FullAddress</em></strong> which combines Address and Location.</li>\n<li>SiteFeatureID , SiteID (From the Site table) and the various site features from the delimited source column site-features.</li>\n</ul>\n</li>\n<li>Create a single fact table called FuelPrice. It should have the columns below:\n<ul>\n<li>FuelPriceID (Identity), BrandID (From the Branch table), SiteID (From the Site table), DateID (Numeric and stored as yyyymmdd), Price, DateCreated (Default to current system time) and DateModified (nullable, no default).</li>\n</ul>\n</li>\n<li>Clean the data in Power BI by removing any uncesscary columns not mentioned above.</li>\n</ol>\n<h3 id=\"visualisation\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#visualisation\"><span class=\"icon icon-link\"></span></a>Visualisation</h3>\n<ol>\n<li>Create visuals using the modelled data that allow the business to answer the following questions.\n<ul>\n<li>When and where can they find the cheapest fuel after the is discount applied?</li>\n<li>See a list of the top 10 sites with the cheapest fuel price?</li>\n<li>Be able to drill-down into all the details for a the top 10 cheapest fuel stations?</li>\n<li>Discover quickly which sites are open 24 hours a day?</li>\n</ul>\n</li>\n</ol>\n<p>The business executives have also asked for how a consistent theme can be applied to the report and other reports in the future.</p>\n<h2 id=\"completion\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#completion\"><span class=\"icon icon-link\"></span></a>Completion</h2>\n<p>When the solution is above is complete, save the PowerBI file and any supporting templates and share with the Consultant/ Talent Acquisition Specialist who contacted you from Telstra Purple.</p>\n<h1 id=\"data-engineer\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#data-engineer\"><span class=\"icon icon-link\"></span></a>Data Engineer</h1>\n<h2 id=\"prerequisites-1\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#prerequisites-1\"><span class=\"icon icon-link\"></span></a>Prerequisites</h2>\n<p>Please build the platform on the cloud environment as nominated by the Consultant/ Talent Acquisition Specialist who has invited you to complete this test.</p>\n<p>To complete this test, you will need:</p>\n<ol>\n<li>Access to a Cloud service provider environment.\n<ul>\n<li>For an Azure Subscription, you can create a <a href=\"https://azure.microsoft.com/en-au/free/\">30-day free trial</a> if you don't have an Azure subscription.</li>\n<li>For an AWS Account, you can utilise <a href=\"https://aws.amazon.com/free/\">AWS free tier</a> if you don't have an AWS Account.</li>\n<li>For an GCP Environment, you can utilise <a href=\"https://cloud.google.com/free\">GCP free tier</a> if you don't have an GCP Account.</li>\n</ul>\n</li>\n<li>Your laptop with your tools/ IDE that you like to work with.</li>\n<li>A public GitHub repo, or a Google/OneDrive where you can share your workings.</li>\n</ol>\n<h2 id=\"scenario-1\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#scenario-1\"><span class=\"icon icon-link\"></span></a>Scenario</h2>\n<p>We are assisting a customer in building out a solution which ingests the latest fuel prices from the Fuel Watch RSS feed. This data is not in a great structure, and we would like to ingest this data into a data lake, perform some transformations and build out a data mart for use in Power BI, the customers visualisation tool of choice.</p>\n<ol>\n<li>Our customer would like to take an infrastructure-as-code approach to the deployment of the new resources however, the delivery of a working prototype is the highest priority.</li>\n<li>All resources should be deployed in Australia.</li>\n</ol>\n<h2 id=\"instructions-1\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#instructions-1\"><span class=\"icon icon-link\"></span></a>Instructions</h2>\n<p>Follow these instructions and deploy using whatever means you feel necessary.</p>\n<h3 id=\"building-the-platform\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#building-the-platform\"><span class=\"icon icon-link\"></span></a>Building the Platform</h3>\n<p>First, create your resources in your Cloud service provider environment.</p>\n<ol>\n<li>Create all resources with the following tags.\n<ul>\n<li>Department - Finance</li>\n<li>Environment - Development</li>\n</ul>\n</li>\n<li>Create a new storage resource with the hierarchical namespace enabled.\n<ul>\n<li>Add a container/bucket called <strong>datalakestore</strong>.</li>\n</ul>\n</li>\n<li>Create the following ETL resource applicable to your Cloud service provider environment.\n<ul>\n<li>Azure - Azure Data Factory</li>\n<li>AWS - Glue Data Pipeline</li>\n<li>GCP - Cloud Data Fusion</li>\n</ul>\n</li>\n<li>Create the following encryption resource to your Cloud service provider environment.\n<ul>\n<li>Azure - Azure Key Vault</li>\n<li>AWS - Key Management Service</li>\n<li>GCP - Secret Manager</li>\n</ul>\n</li>\n<li>Create a new SQL PaaS database called <strong>DataMart</strong>.\n<ul>\n<li>The database size should be 20GB.</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"ingestion\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#ingestion\"><span class=\"icon icon-link\"></span></a>Ingestion</h3>\n<p>The source data you will be using is the <a href=\"http://www.fuelwatch.wa.gov.au/fuelwatch/fuelWatchRSS\">FuelWatch RSS feed</a> from the Western Australian Government.</p>\n<ol>\n<li>Copy the storage resource key/secrets for the storage and save it in the deployed encryption resource.\n<ul>\n<li>Use the name <strong>dataLakeStorageAccountKey</strong> or similar as the secret name.</li>\n</ul>\n</li>\n<li>Ingest the RSS feed into the into the <strong>datalakestore</strong> in the storage account deployed above.\n<ul>\n<li><strong><em>Hint:</em></strong> You can use the HTTP linked service and an XML file type as the dataset type.</li>\n</ul>\n</li>\n<li>Import the item array with all related fields into a parquet file in the storage account with the path below.\n<ul>\n<li>datalakestore/Raw/FuelWatch/.</li>\n<li>The file name should be <strong>feed.parquet</strong>.</li>\n</ul>\n</li>\n<li>Once the file has been imported into the data lake, add another activity to the same pipeline which reads the parquet file from the data lake and writes it to the DataMart SQL database.\n<ul>\n<li>Use a temporary table in the tempstage schema called <strong>FuelPrices</strong>. This activity must run after the activity to import the source data.</li>\n<li>The connection to the SQL PaaS database should ideally make use of the identity from the ETL pipeline resource or the secrets from the encryption resource.</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"modelling-1\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#modelling-1\"><span class=\"icon icon-link\"></span></a>Modelling</h3>\n<p>Once the temporary data has been loaded into the data mart, transform the data into fact and dimension tables for our user-consumed data model. All objects should be created in a new schema named <strong>dw</strong>.</p>\n<ol>\n<li>Create three (3) new dimension tables - <strong>Brand</strong>, <strong>Site</strong> and <strong>SiteFeatures</strong>. They should have the respective attributes below.\n<ul>\n<li>BrandID (Identity, clustered primary key), BrandName</li>\n<li>SiteID (Identity, clustered primary key), TradingName, Location, Address, Phone, Latitude, Longitude. Add a computed, persisted column named FullAddress which combines Address and Location.</li>\n<li>SiteFeatureID (Identity, clustered primary key), SiteID (From the Site table) and the various site features from the delimited source column site-features.</li>\n</ul>\n</li>\n<li>Create a single fact table called <strong>FuelPrice</strong>. It should have the columns below:\n<ul>\n<li>FuelPriceID (Identity), BrandID (From the Branch table), SiteID (From the Site table), DateID (Numeric and stored as yyyymmdd), Price, DateCreated (Default to current system time) and DateModified (nullable, no default).</li>\n</ul>\n</li>\n<li>Add a primary key across the SiteID, BrandID and DateID columns and a clustered index on the DateID column.\n<ul>\n<li>The naming convention for the index should be <code>IDX_&#x3C;Table Name>_&#x3C;Column Name></code>.</li>\n</ul>\n</li>\n<li>Create appropriate artefacts, scripts or pipelines to populate the tables above.\n<ul>\n<li>Keep these artefacts handy for the technical interview.</li>\n</ul>\n</li>\n</ol>\n<h2 id=\"completion-1\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#completion-1\"><span class=\"icon icon-link\"></span></a>Completion</h2>\n<p>When the solution above is complete, save any artefacts created and share them with the Consultant/Talent Acquisition Specialist who contacted you from Telstra Purple. If also possible, please keep your Cloud service provider environment running until the in-person technical interview has been conducted or as otherwise advised.</p>"}