{"metadata":{"title":"DevOps","interviews":"Automation Specialist","sortorder":4},"content":"<h1 id=\"automation-specialist\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#automation-specialist\"><span class=\"icon icon-link\"></span></a>Automation Specialist</h1>\n<h2 id=\"prerequisites\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#prerequisites\"><span class=\"icon icon-link\"></span></a>Prerequisites</h2>\n<p>Please build the platform on the cloud environment as nominated by the Consultant/Talent Acquisition Specialist who has invited you to complete this test.</p>\n<p>In order to complete this test, you will need:</p>\n<ol>\n<li>A GitHub account with access to GitHub Actions and public repo.\n<ul>\n<li>If you're more comfortable with Azure DevOps or AWS Pipelines you may use this for the pipeline development.</li>\n</ul>\n</li>\n<li>Access to an Cloud service provider environment.\n<ul>\n<li>For an Azure Subscription, you can create a <a href=\"https://azure.microsoft.com/en-au/free/\">30-day free trial</a> if you don't have an Azure subscription.</li>\n<li>For an AWS Account, you can utilise <a href=\"https://aws.amazon.com/free/\">AWS free tier</a> if you don't have an AWS Account.</li>\n</ul>\n</li>\n<li>Your laptop with your tools/IDE that you like to work with.</li>\n</ol>\n<h2 id=\"scenario\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#scenario\"><span class=\"icon icon-link\"></span></a>Scenario</h2>\n<p>We're after an environment for your software developer colleagues to work in. The long-term goal is that we'll be building a like-for-like environment for UAT and Production later but right now this is just for Development… Setting up for success.</p>\n<p>The development team are after a new SQL PaaS database that must be connected to a virtual network using a secure endpoint. The operations team expect this to be deployed using automation pipelines that are also idempotent and well-governed.</p>\n<h2 id=\"instructions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#instructions\"><span class=\"icon icon-link\"></span></a>Instructions</h2>\n<p>While the business is interested in making use of Terraform, they are currently only making use of PowerShell, CLI and Cloud specific templates (i.e. Azure Resource Manager or CloudFormation templates). It's expected that the pipelines built by you would use the same methodology unless you can provide suitable documentation highlighting the benefits of another technology.</p>\n<p>The development team colleagues have shared their templates with you. They have not been tested, but they have used them for their sandbox environment.</p>\n<ul>\n<li>For Azure:\n<ol>\n<li><a href=\"/code/sqldatabase.json\">SQL Database template</a></li>\n<li><a href=\"/code/networking.json\">Virtual Network template</a></li>\n</ol>\n</li>\n<li>For AWS:\n<ol>\n<li><a href=\"/code/rds-cf-template.json\">SQL RDS instance</a></li>\n</ol>\n</li>\n</ul>\n<h3 id=\"requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#requirements\"><span class=\"icon icon-link\"></span></a>Requirements</h3>\n<p>As the automation specialist, we need:</p>\n<ul>\n<li>A pipeline that builds and deploys the <strong>Development</strong> environment only.</li>\n<li>The <strong>UAT</strong> and <strong>Production</strong> environments would be built later though using the same build artefact.</li>\n<li>The pipeline must use variables and have no plain text secrets.</li>\n<li>If it doesn't exist, the pipeline must create the supporting environment.</li>\n<li>Each environment would use the same virtual network.</li>\n</ul>\n<p>In addition to the pipeline, the operations team wish for there to be a branch policy that prevents pushes directly to the <strong>main</strong> branch.</p>\n<h2 id=\"completion\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#completion\"><span class=\"icon icon-link\"></span></a>Completion</h2>\n<p>When the solution above is complete, save any artefacts created into a source code repository (e.g. GitHub) and share this repository (or artefacts) with the Consultant/Talent Acquisition Specialist who contacted you from Telstra Purple. If also possible, please keep your Cloud service provider environment running until the in-person technical interview has been conducted or as otherwise advised.</p>"}